In [48]:
import pandas as pd

In [49]:
unicentro = pd.Series([12, 8, 10, 15, 5, 12, 17, 20], index = ['Nike', 'Adidas', 'Rebook', 'Puma', 'UnderArmour', 'Salomon', 'Fila', 'Arcterix'])

arboleda = pd.Series([34, 21, 7, 2, 3, 12, 4, 6], index = ['Puma', 'Adidas', 'Nike', 'Rebook', 'UnderArmour', 'Salomon', 'Fila', 'Arcterix'])

bolivar = pd.Series([10, 23, 13, 24, 9, 4, 8, 6], index = ['Nike', 'Adidas', 'Arcterix', 'Puma', 'Fila', 'Rebook', 'Salomon', 'UnderArmour'])

ventas = pd.DataFrame({'Arboleda': arboleda, 'Unicentro': unicentro, 'Bolivar': bolivar})

ventas['Total'] = arboleda + unicentro + bolivar

print(ventas)

ventas.to_csv('ventas.csv', sep=';')

             Arboleda  Unicentro  Bolivar  Total
Adidas             21          8       23     52
Arcterix            6         20       13     39
Fila                4         17        9     30
Nike                7         12       10     29
Puma               34         15       24     73
Rebook              2         10        4     16
Salomon            12         12        8     32
UnderArmour         3          5        6     14

In [50]:
tenis = pd.read_csv('ventas.csv', sep=';', skiprows=0)
tenis

    Unnamed: 0  Arboleda  Unicentro  Bolivar  Total
0       Adidas        21          8       23     52
1     Arcterix         6         20       13     39
2         Fila         4         17        9     30
3         Nike         7         12       10     29
4         Puma        34         15       24     73
5       Rebook         2         10        4     16
6      Salomon        12         12        8     32
7  UnderArmour         3          5        6     14

In [54]:
data = {'first_name': ['Sigrid', 'Joe', 'Theodoric','Kennedy', 'Beatrix', 'Olimpia', 'Grange', 'Sallee'],
        'last_name': ['Mannock', 'Hinners', 'Rivers', 'Donnell', 'Parlett', 'Guenther', 'Douce', 'Johnstone'],
        'age': [27, 31, 36, 53, 48, 36, 40, 34],
        'amount_1': [7.17, 1.90, 1.11, 1.41, 6.69, 4.62, 1.01, 4.88],
        'amount_2': [8.06,  "?", 5.90,  "?",  "?", 7.48, 4.37,  "?"]}

df = pd.DataFrame(data, columns = ['first_name', 'last_name', 'age', 'amount_1', 'amount_2'])


df.to_excel('nombres.xlsx', sheet_name='example')

In [60]:
nombres = pd.read_excel('nombres.xlsx', header = None, skiprows=1)
nombres

   0          1          2   3     4     5
0  1        Joe    Hinners  31  1.90     ?
1  2  Theodoric     Rivers  36  1.11   5.9
2  3    Kennedy    Donnell  53  1.41     ?
3  4    Beatrix    Parlett  48  6.69     ?
4  5    Olimpia   Guenther  36  4.62  7.48
5  6     Grange      Douce  40  1.01  4.37
6  7     Sallee  Johnstone  34  4.88     ?

In [61]:
data = ["Línea 1", "Línea 2", "Línea 3", "Línea 4", "Línea 5"]

In [63]:
fic = open("text_1.txt", "w")

for line in data:
    fic.write(line)
    fic.write("\n")
    
fic.close()

In [64]:
fic = open("text_2.txt", "w")

for line in data:
    print(line, file=fic)
    
fic.close()

In [65]:
fic = open("text_3.txt", "w")
fic.writelines("%s\n" % s for s in data)
fic.close()

In [70]:
arboleda = pd.Series([34, 21, 7, 2, 3, 12, 4, 6], index = ['Puma', 'Adidas', 'Nike', 'Rebook', 'UnderArmour', 'Salomon', 'Fila', 'Arcterix'], name = 'Sucursal')

cc_arboleda = open('arboleda.txt', 'w')

for i in arboleda:
    print(i, file = cc_arboleda)

cc_arboleda.close()